# Queries: Salika Core Assignment

In [2]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()

In [3]:
from sqlalchemy import create_engine

In [4]:
# Create connection string
username = "root"
password = "root"
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [5]:
engine = create_engine(connection)

In [6]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [7]:
q = """SELECT cu.first_name, cu.last_name, cu.email, cu.address_id, ci.city
FROM customer as cu
JOIN city as ci
ON cu.address_id = ci.country_id
WHERE ci.city_id = 312;"""
pd.read_sql(q, engine)

  first_name last_name                               email  address_id    city
0    LILLIAN   GRIFFIN  LILLIAN.GRIFFIN@sakilacustomer.org         102  London

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [8]:
q = """SELECT f.title, f.description, f.release_year, f.rating, f.special_features
FROM film as f
JOIN category as c
ON f.film_id = c.category_id
WHERE c.name = 'Comedy';"""
pd.read_sql(q, engine)

,title,description,release_year,rating,special_features
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [9]:
q = """SELECT a.last_name, f.title, f.release_year
FROM film as f
JOIN actor as a
ON f.film_id = a.actor_id
WHERE a.last_name = 'Lollobrigida';"""
pd.read_sql(q, engine)

      last_name        title  release_year
0  LOLLOBRIGIDA  AFRICAN EGG          2006

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [10]:
q = """SELECT a.first_name, a.last_name, f.title
FROM film as f
JOIN actor as a
ON f.film_id = a.actor_id
WHERE f.title = 'Bingo Talented';"""
pd.read_sql(q, engine)

  first_name last_name           title
0       GARY      PENN  BINGO TALENTED

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [13]:
q = """SELECT c.customer_id, p.amount
FROM customer as c
JOIN payment as p
ON c.address_id = p.customer_id
WHERE p.amount >
	(SELECT 2*AVG(amount)
    FROM payment);"""
pd.read_sql(q, engine)

     customer_id  amount
0              1    8.99
1              1    9.99
2              3    8.99
3              3    8.99
4              4    9.99
..           ...     ...
845          589    9.99
846          589   10.99
847          591    8.99
848          593    9.99
849          593    8.99

[850 rows x 2 columns]

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [14]:
q = """SELECT c.first_name, c.last_name, COUNT(p.amount) as num_payments
FROM customer as c
JOIN payment as p
ON c.address_id = p.customer_id
GROUP BY c.first_name, c.last_name
ORDER BY num_payments DESC
LIMIT 5;"""
pd.read_sql(q, engine)

  first_name     last_name  num_payments
0      CLARA          SHAW            46
1   MITCHELL  WESTMORELAND            45
2  CONSTANCE          REID            42
3        EVA         RAMOS            42
4      KATHY         JAMES            41